[{"date": "2021-10-31", "title": "Not worth what I paid for", "stars": "1.0 out of 5 stars", "review": "The wick was covered in wax. I had to get it out with a knife. I lit it up and it wouldn't stay lit because of the wax accumulating around the wick so there was basically never a flame but a little bit of blue light before it would extinguish. Never again."}, {"date": "2021-03-17", "title": "Smells like Gasoline. Manufacturer replacing.", "stars": "2.0 out of 5 stars", "review": "UPDATED: Amazon advised I'd have to contact the manufacturer (Yankee Candle) directly as it was past the return date. They were very helpful.\nThey are sending me a replacement, however, there may be duties on it when it arrives due to it shipping from the US. Will update again when I receive the candle. If the duties are high, I'll have to contact them again for a better solution as I'm not paying more money for a new candle when it's supposed to be replaced at no cost to me. The candle smelling like gas was in no way my fault.\n---\nI was smelling the scent of gasoline in my office; I don't have any gas appliances and u checked my furnace. I've lite the candle only a few times and decided I should smell it because, who knows, maybe it's the candle. Shockingly it was! Pure gasoline.\n\nVery dissapointed as Yankee candles are not cheap and I now have a full French Vanilla Gasoline candle that I can't burn and paid almost $40 for."}, {"date": "2021-02-07", "title": "Disappointing lack of scent", "stars": "1.0 out of 5 stars", "review": "This has no vanilla scent. Previously I purchased the pine scent and it was fantastic. This vanilla one doesn’t have any smell and is very disappointing. For the price of a Yankee Candle, I expect high quality and a good scent."}, {"date": "2021-01-30", "title": "Very pleased will purchase again !", "stars": "5.0 out of 5 stars", "review": "see headline"}, {"date": "2021-01-01", "title": "Known product", "stars": "5.0 out of 5 stars", "review": "A known product and delivered by a proven supplier so all went well as one would expect."}, {"date": "2020-12-06", "title": "Exactly as I expected. Soft mild scent.", "stars": "5.0 out of 5 stars", "review": "Excellent size."}, {"date": "2020-10-22", "title": "I love this candle", "stars": "5.0 out of 5 stars", "review": "I love these candles especially vanilla. Nothing can compare . They last forever and smell great"}, {"date": "2020-10-01", "title": "👍🏼", "stars": "5.0 out of 5 stars", "review": "👍🏼"}, {"date": "2020-09-23", "title": "You're not going to smell it", "stars": "3.0 out of 5 stars", "review": "It's a really nice candle and it looks like it's going to last me a long time, but the scent is weak. You're only really going to smell it when you're very close. I live in a tiny apartment and it's still not filling the room I'm in let alone the rest of the apartment. It has a nice slow burn though, so I know it'll last me, I just wish the smell was stronger."}, {"date": "2020-07-01", "title": "Nice scent", "stars": "3.0 out of 5 stars", "review": "Nice smelling candle . A little over priced . I now know that you can get it cheaper on other sites"}, {"date": "2020-06-13", "title": "Smells great", "stars": "5.0 out of 5 stars", "review": "Smells great"}, {"date": "2020-05-19", "title": "For Mother's Day", "stars": "5.0 out of 5 stars", "review": "My mother loves the candle. She said the scent is lovely, and fills the room even without lighting the candle."}, {"date": "2020-05-12", "title": "There's no scent.", "stars": "1.0 out of 5 stars", "review": "I'm a Yankee Candle OG, this is the first candle I've had with zero scent. No value."}, {"date": "2020-05-11", "title": "No bang for your buck - smell is too faint", "stars": "1.0 out of 5 stars", "review": "I would not recommend this particular scent from this brand. I have tried other Yankee Candles and the smell always circulates nicely in the kitchen/living room due to the size and potency of these candles. French Vanilla, however, is such a faint scent and the room barely smelled like it. If I'm spending nearly $40 on a candle, I expect the scent to be very strong and spread throughout at least one room. I'm pretty disappointed with this purchase."}, {"date": "2020-04-30", "title": "Great quality", "stars": "4.0 out of 5 stars", "review": "Recieved it finally"}, {"date": "2020-04-27", "title": "Broken -Update", "stars": "4.0 out of 5 stars", "review": "I'm updating this review as although we received the candle cracked, we were automatically refunded within a week. The candle itself smells lovely, so we will definitely try to buy it again. Thank you!"}, {"date": "2020-04-26", "title": "Amazing smell, would purchase again", "stars": "5.0 out of 5 stars", "review": "When I first ordered this candle I was scared because of the reviews saying it smelt like nothing, however, as soon as I lit this candle it gave my room a nice sweet smell that wasn't overbearing. My room is in the basement so within half an hour you could smell the candle from the stairs. My family loves the smell this candle gives off and I could recommend this to anyone."}, {"date": "2020-01-14", "title": "Very weak fragance", "stars": "1.0 out of 5 stars", "review": "I don't get how Yankee Candle is a market leader. The scent is very weak, barely perceptible compared with other scented candles. On the plus side, the candle does burn for a long time. Still not worth $35."}, {"date": "2019-12-31", "title": "No scent?", "stars": "1.0 out of 5 stars", "review": "I always thought Yankee Candles were low quality based on my own previous experiences with them, but everyone loves them so much and this product got rave reviews (which I read to ensure they suited my needs), so I figured the formula must have changed over the years and I should give them another shot. Especially because everyone commented on the scent of this candle and I am a vanilla die-hard. But there is no scent to this candle at all, and it isn't a faulty candle - this is just how Yankee Candles are, in my every experience. I left this candle on for *hours*, but I couldn't smell anything, so left the room and came back after about a half hour, and still no scent. Save your money, there are plenty better candles on Amazon, or take a quick trip to Bath and Body Works. Those candles fill up my room with delicious scents within minutes."}, {"date": "2019-05-12", "title": "Quick delivery and cheaper than at the store", "stars": "5.0 out of 5 stars", "review": "Quick delivery and cheaper than going to the store to purchase. Absolutely love this candle - light it every time we use the deep fryer and the scent is strong enough to cut through the grease smell but not so strong that it causes headaches."}]