[{"date": "2021-12-10", "title": "Cher au plein prix", "stars": "5.0 out of 5 stars", "review": "Je m'en sers surtout en cas d'urgence...panne d'électricité. Ça dure vraiment longtemps. Faut que la cire aille le temps de devenir liquide d'un côté a l'autre du pot avant de l'éteindre...sinon la mèche brûle plus vite que le reste de la chandelle et va faire un trou au centre et quand vous voudrez la laisser allumé longtemps , la cire autour va noyé la mèche et s'éteindre ..."}, {"date": "2021-12-04", "title": "bon parfun", "stars": "5.0 out of 5 stars", "review": "parfun, tres agréable, tres doux,"}, {"date": "2021-11-30", "title": "L’odeur est parfaite", "stars": "4.0 out of 5 stars", "review": "Le prix est abordable! Le parfum de la chandelle est sublime et dure longtemps"}, {"date": "2021-10-27", "title": "No smell", "stars": "1.0 out of 5 stars", "review": "Very disappointed. Haven't bought this product for a long time, mainly the price. Decided to buy and now I wish I didn't."}, {"date": "2021-10-19", "title": "Lovely scented candle", "stars": "5.0 out of 5 stars", "review": "Very nice candle. Was given as a gift and she loved it!"}, {"date": "2021-09-19", "title": "Genial", "stars": "5.0 out of 5 stars", "review": "Love it"}, {"date": "2021-09-16", "title": "It smells marvelous 💖💖💖", "stars": "4.0 out of 5 stars", "review": "I haven't ever smelt lilac this well. Bought one and like it sooo much that I bought a second a week later. Lilacs a plenty with help from Yankee candle"}, {"date": "2021-08-28", "title": "wonderful fragrance", "stars": "5.0 out of 5 stars", "review": "nice and light , beautiful scent"}, {"date": "2021-05-24", "title": "Has no scent", "stars": "1.0 out of 5 stars", "review": "This candle has no smell. Unless you stick your nose in it while burning. What a disappointment!"}, {"date": "2021-05-17", "title": "Candle", "stars": "5.0 out of 5 stars", "review": "Was a birthday gift for my sister and she absolutely loves it"}, {"date": "2021-05-14", "title": "Beautifully fills the room with an island scent", "stars": "5.0 out of 5 stars", "review": "Ive always been curious as to what this candle smelt like and I read all the reviews and eventually broke down and bought it. Love it! Great summer scent. If I burn too long it triggers a headache only because Im not use to sweeter, citrus/florally scents, but definitely has gotten me compliments. Would definitely buy around to mix up my candle scents around the house."}, {"date": "2021-05-12", "title": "Scent not for me", "stars": "1.0 out of 5 stars", "review": "I read the reviews to see if this would be a scent for me. Definitely not a walk on the beach! more like a walk into my grandmother's bathroom - the perfume / soapy/ powder notes is just not a scent for me!"}, {"date": "2021-05-06", "title": "Not getting what I paid for...", "stars": "1.0 out of 5 stars", "review": "So I ordered a Lilac Blossoms scented candle, but I received a box for a Lilac Blossom Scented candle but inside was a Mango Peach Salsa scented candle. Not impressed considering the cost of these candles.."}, {"date": "2021-04-27", "title": "Nice, Expensive and burns quick.", "stars": "4.0 out of 5 stars", "review": "The scent is really nice It’s a good candle. It burns nice and evenly but pretty fast. It’s pretty expensive for a candle. (I guess that’s just the brand) It would make a great gift. I bought one more in a different scent and will see if I can make it last longer"}, {"date": "2021-04-27", "title": "Like it but my nose not so much", "stars": "4.0 out of 5 stars", "review": "I love the smell of lilacs and when I got the winter blues, I figured this would help lift my spirits up a bit. The smell is very much \"lilacy\", almost too much so. If we leave it on for too long, both my hubby and I start getting stuffed up. We still use it occasionally, we simply make sure to not leave it on too long. By the size of it, it looks like we'll have it for a while lol"}, {"date": "2021-04-24", "title": "😡", "stars": "1.0 out of 5 stars", "review": "Came broken!!!"}, {"date": "2021-04-16", "title": "Simply the best", "stars": "5.0 out of 5 stars", "review": "Best lilac candle on the market !"}, {"date": "2021-04-15", "title": "Very very strong", "stars": "1.0 out of 5 stars", "review": "Usually I like these candles however this one very very strong . Probably not wise to burn around your pets . Makes my eyes water ."}, {"date": "2021-03-09", "title": "Great quality!", "stars": "5.0 out of 5 stars", "review": "One of my new favourite scents, it’s very subtle, so perfect if you don’t like overwhelming scents!"}, {"date": "2021-03-05", "title": "Great product", "stars": "5.0 out of 5 stars", "review": "Great product"}, {"date": "2021-03-03", "title": "Beautiful Smell!", "stars": "5.0 out of 5 stars", "review": "Soo nice."}, {"date": "2021-02-28", "title": "Do Not Buy", "stars": "1.0 out of 5 stars", "review": "This product is not a real Yankee candle I looked up the bar code because packaging looked off and sure enough it is fake. 😒"}, {"date": "2021-02-28", "title": "Smells fabulous", "stars": "5.0 out of 5 stars", "review": "My whole family loves the scent of this beautiful candle. Thank you so very much."}, {"date": "2021-02-26", "title": "Will be ordering again!", "stars": "5.0 out of 5 stars", "review": "We enjoyed the scent"}, {"date": "2021-02-24", "title": "Authentic Lilac aroma", "stars": "5.0 out of 5 stars", "review": "Love the scent, very relaxing 😌"}, {"date": "2021-02-21", "title": "Sens pas grand chose", "stars": "3.0 out of 5 stars", "review": "Tres beau mais le parfum est faible"}, {"date": "2021-02-05", "title": "Best scent ever!", "stars": "5.0 out of 5 stars", "review": "By far the most fragrant candle I’ve had. Get tons of compliments on the scent. Long lasting..love it"}, {"date": "2021-02-01", "title": "Prefer it to the smell of lavendar.", "stars": "5.0 out of 5 stars", "review": "Truly smells like a lilac bush. Always loved the smell of lilacs."}, {"date": "2021-01-30", "title": "damaged packaging and damaged glass jar", "stars": "1.0 out of 5 stars", "review": "When I received my yankee candle, lavender vanilla, the top of the glass was broken and jagged. I cut my finger on it getting it out of the packaging. The packaging (cardboard) was also damaged. I would like another candle free of charge to replace this damaged one please."}, {"date": "2021-01-30", "title": "Well packed smells great!", "stars": "5.0 out of 5 stars", "review": "Came well packed no issues , it smells beautiful very soft pleasant scent."}, {"date": "2021-01-30", "title": "Ok", "stars": "5.0 out of 5 stars", "review": "Très beau à offrir en cadeau"}, {"date": "2021-01-18", "title": "Disappointed", "stars": "1.0 out of 5 stars", "review": "I miss my Grandma. Her favourite flower was lilac. I ordered this candle on her birthday. Unfortunately, when I received it, the Yankee Candle packaging did say lilac but when I opened it, it was an overpowering black candle... I think Mid Summer Night. I have wondered what that one smelled like but turns out I hate it. Had to return. Will try again next birthday, I guess."}, {"date": "2021-01-14", "title": "Smells SOOOO good", "stars": "5.0 out of 5 stars", "review": "Bought this as a Christmas gift for my sister and she loved it. If you love lavender and vanilla, you can't go wrong! The last time I bought one of these candles, it lasted me 3 months!"}, {"date": "2021-01-14", "title": "The Best Yankee Candle Ever. Smells like Heaven and burns for a long time", "stars": "5.0 out of 5 stars", "review": "Best Smelling Yankee Candle Hands Down"}, {"date": "2021-01-10", "title": "Lilac Candle", "stars": "5.0 out of 5 stars", "review": "My girlfriend loooooves lilac candles. So I buy them frequently. The price does seem excessive for a scented lantern, but the smell is good and it lasts quite a long time."}, {"date": "2021-01-10", "title": "U Can do Better", "stars": "1.0 out of 5 stars", "review": "No discernable scent.\nPackaging eh\nGlass very heavy to lift up or mail\nNot impressed quite expensive considering the price"}, {"date": "2021-01-03", "title": "Great candle, shoutout to Masego", "stars": "5.0 out of 5 stars", "review": "Heard about this candle from a Masego interview and my partner bought this for me as a gift. I have been destroying this candle and must ration it more. Scents are personalized of course but for me this scent absolutely SLAPS. It has a sweet fruitiness with a tiny bit of floral scent that does not smell like an old person's bathroom."}, {"date": "2020-12-24", "title": "Yankee Candle Lilac Blossoms Large Jar 22 oz Candle", "stars": "5.0 out of 5 stars", "review": "Love Yankee Candles. They have a great scent that can fill large rooms, while still being subtle and fragrant. Burns very evenly. This is a great scent to boost relaxation and calmness."}, {"date": "2020-12-09", "title": "Great scent", "stars": "5.0 out of 5 stars", "review": "Loved it. First one gone now. Need more"}, {"date": "2020-11-22", "title": "Small throw", "stars": "3.0 out of 5 stars", "review": "Beautiful scent but doesn't have much throw. Also the wick is messed up and it is not burning evenly"}, {"date": "2020-10-17", "title": "No scent when lit?", "stars": "1.0 out of 5 stars", "review": "Disappointed. I’ve wanted to try this candle for years, and I was so excited to come home and light this, but after 4 hours, there was barely any scent. Like I had to sniff for it, but it wasn’t there. I agree with the comment saying you can smell it more when it’s not lit.\nSad that I threw out the box, but if I find another box for it to fit in, then I will return it. Maaaybe I’ll give a different yankee candle a go, but this first yankee purchase was a big disappointment.\n\nI read through the comments and there were enough people saying it smelled wonderful. Did I get a bad batch or something? I should have gone for the salted caramel instead"}, {"date": "2020-10-13", "title": "Burns very well", "stars": "5.0 out of 5 stars", "review": "If you like the smell of lilac you'll love this candle."}, {"date": "2020-09-26", "title": "overrated", "stars": "3.0 out of 5 stars", "review": "You are definitely paying for the name. The scent is underwhelming. I want a candle that fills the room wth a pretty aroma. It barely has a scent."}, {"date": "2020-08-31", "title": "Always good quality", "stars": "5.0 out of 5 stars", "review": "Best candle ever"}, {"date": "2020-08-09", "title": "Smells awesome", "stars": "5.0 out of 5 stars", "review": "Was well packaged and arrive in perfect shape. The candle itself smells amazing and burns evenly. Definitely worth the money."}, {"date": "2020-08-05", "title": "Packaged well", "stars": "4.0 out of 5 stars", "review": "Didn’t smell bad but isn’t the greatest scent either."}, {"date": "2020-07-29", "title": "Nice Candle", "stars": "1.0 out of 5 stars", "review": "Too bad that it arrived broken."}, {"date": "2020-07-20", "title": "Smells just like summer", "stars": "5.0 out of 5 stars", "review": "Love the smell of lilacs and this candle smells exactly like that (to me at least).\nThe candle came very well packed in a Yankee Candle cardboard box with cardboard inserts. Happy with purchase."}, {"date": "2020-06-15", "title": "Love it", "stars": "5.0 out of 5 stars", "review": "Love the scent"}, {"date": "2020-06-04", "title": "Hardly any scent - waste of money", "stars": "2.0 out of 5 stars", "review": "Can barely smell it, zero throw. From what I could smell it was a light tropical floral scent. It was about as good as the glade one you can get on the add on item deal. You may as well buy that one. Would not buy Yankee again"}, {"date": "2020-06-04", "title": "Nice, accurate scented candle", "stars": "4.0 out of 5 stars", "review": "Really nice burning candle, well scented but overpriced when you can get them retail for alot less. Just the convenience during Covid made it easier and safer to buy online."}, {"date": "2020-06-02", "title": "LOVE this candle", "stars": "5.0 out of 5 stars", "review": "This scent is my absolute favourite. Burn length is great and never loses its scent."}, {"date": "2020-05-31", "title": "The best", "stars": "5.0 out of 5 stars", "review": "Smells like heaven! I can’t explain the scent other than amazing!"}, {"date": "2020-02-20", "title": "Great but.", "stars": "5.0 out of 5 stars", "review": "It came early, and this is my favourite scent. It makes me think of spring."}, {"date": "2020-02-06", "title": "What's not to love?", "stars": "5.0 out of 5 stars", "review": "What can I say ... candles are great. Yankee Candles are great. The lilac aroma is great. All in a contained glass jar. No mess, nice smell, pretty candle - what's not too love?\n1 recommendation - if you buy a lot of these types of candles, invest in a wick trimmer (amazon has a bunch) ... keeping the wick nice a trimmed will prevent soot getting on the side of the jar as it burns down.\nWill buy again."}, {"date": "2020-01-13", "title": "No smell ???", "stars": "1.0 out of 5 stars", "review": "No small I'm very upset because I've been a Yankee candles customer for many years."}, {"date": "2020-01-01", "title": "Love, love, love.", "stars": "5.0 out of 5 stars", "review": "Love that Yankee Candle's Lilac Blossoms has stayed the same over the years."}, {"date": "2019-11-17", "title": "It came broken", "stars": "1.0 out of 5 stars", "review": "It came broken because it was packaged in a flimsy egg carton. This was for my mom's birthday."}, {"date": "2019-06-22", "title": "Love it", "stars": "5.0 out of 5 stars", "review": "Smells great"}, {"date": "2019-05-10", "title": "Lovely smell", "stars": "5.0 out of 5 stars", "review": "Long lasting great smell"}]