[{"date": "2021-12-18", "title": "Smell very good.", "stars": "5.0 out of 5 stars", "review": "The aroma of this candle is very sweet. It last a lot. I'll buy it again."}, {"date": "2021-12-16", "title": "Presque pas parfumée", "stars": "3.0 out of 5 stars", "review": "Je souhaitais avoir une bougie qui parfume toute la maison et ce n’est pas le cas"}, {"date": "2021-12-10", "title": "Yankee this!", "stars": "3.0 out of 5 stars", "review": "Some candles are better than others. This particular one is little too strong smelling but tolerable for hour at a time. Pricing freshness."}, {"date": "2021-12-01", "title": "Smells good!", "stars": "5.0 out of 5 stars", "review": "I will buy more in the future and these make the perfect gifts!\nThe Midsummer's Night scent is perfect for men!"}, {"date": "2021-11-20", "title": "Ugh terrible scent", "stars": "1.0 out of 5 stars", "review": "Have no idea what the scent is supposed to be but it’s very subtle and even then it’s not a nice scent.\nDon’t waste your money."}, {"date": "2021-11-17", "title": "j'adore l'odeur", "stars": "5.0 out of 5 stars", "review": "Que dire de cette odeur , plutôt masculine , ce que j'adore , un fond de musk comme je les aimes .."}, {"date": "2021-11-16", "title": "Best scented candle", "stars": "5.0 out of 5 stars", "review": "Best yankee scent in my opinion. Good value"}, {"date": "2021-11-12", "title": "Price", "stars": "5.0 out of 5 stars", "review": "too expensive"}, {"date": "2021-10-23", "title": "Long lasting candle", "stars": "5.0 out of 5 stars", "review": "Wonderful scent!"}, {"date": "2021-10-02", "title": "Came with wax licking all over the lid", "stars": "1.0 out of 5 stars", "review": "I would't purchase - when i received this there was wax all over the lid and it was pretty messy to clean."}, {"date": "2021-09-26", "title": "Gorgeous aroma", "stars": "5.0 out of 5 stars", "review": "I adore the aroma of baby powder. Relaxes you . Like smelling a newborn baby."}, {"date": "2021-09-11", "title": "Both Chocolate Layer Cake AND Pumpkin Apple Parfait smell wonderful", "stars": "5.0 out of 5 stars", "review": "I've had Chocolate Layer Cake before years ago and it was a favourite then. I hadn't had any in years, since Yankee stopped shipping to Canada.\n\nBut when I saw it on Amazon, I ordered one. It smells, as I said in the title, very much just as good as I remember it. Just delicious chocolate cake. You can smell both the cake and the rich icing And it just smells chocolatey and wonderful.\n\nIt's burning well too.\n\nI found that these desserty candles almost just as good as eating actual cake. I actually use them as a diet aid. I light one up each day, take a few deep breaths, mediate, read and relax for a few hours. It leads to less actual cravings for desserts as I feel like I'm already having the experience of it each day.\n\nChocolate just makes me happy. And this is a really nice chocolate\n\nAs for the Pumpkin Apple Parfait, I just tried it for the first time and loveit too.\n\nIt has a beautiful apple scent. I then do smell a vanilla/caramelly scent. And then there is some pumpkin in there too. Although the cent of this one faded quite a bit afew days in But overall, I'm happy with this one too. Both smell delicious"}, {"date": "2021-08-21", "title": "Very disappointed", "stars": "1.0 out of 5 stars", "review": "I was looking forward to this candle for 6 months ,got amazon card for my birthday and ordered it ..Yankee Candles were my favorite ,The smell of the chocolate cake was not the smell of chocolate cake ..I burned it for a while and still not smelling like chocolate cake ..I was thinking maybe sat on shelf for years ..Don't know .But will not be ordering any again."}, {"date": "2021-08-19", "title": "Yankee never disappoints", "stars": "5.0 out of 5 stars", "review": "This candle arrived very securely packaged all intact. As usual Yankee Candles never disappoint me. Descent appears to be absolutely awesome. Looking forward to burning it at Christmas time. The fragrance seems spot on for mistletoe. You could never go wrong with a Yankee candle. Highly recommended."}, {"date": "2021-08-10", "title": "Scent is incredibly weak.", "stars": "1.0 out of 5 stars", "review": "candle for 3 hours and didn’t smell anything from a distance of 3 ft in a closed space. Glass is also very fragile, broke the tip of the jar easily but it’s still holding the candle inside"}, {"date": "2021-08-06", "title": "Not impressed", "stars": "2.0 out of 5 stars", "review": "Candle smelled nice but it burned awkwardly did not burn for the hours it said it would most of the candle wax was surrounding the jar when the wick was at the end not happy"}, {"date": "2021-08-03", "title": "The wrong scent was delivered and it even broke.", "stars": "1.0 out of 5 stars", "review": "The wrong scent was delivered and it even broke. :("}, {"date": "2021-08-03", "title": "Love the smell", "stars": "5.0 out of 5 stars", "review": "Smells soooo good"}, {"date": "2021-08-02", "title": "No Scent", "stars": "1.0 out of 5 stars", "review": "Have had in car for over a week and still no scent"}, {"date": "2021-07-01", "title": "Nice", "stars": "5.0 out of 5 stars", "review": "Love the scent and great for gift"}, {"date": "2021-05-19", "title": "One of my favourite scents....", "stars": "3.0 out of 5 stars", "review": "But too much black smoke if the wick get a little long. You need to cut wick regularly which gets a little difficult."}, {"date": "2021-05-18", "title": "Best ever bought", "stars": "5.0 out of 5 stars", "review": "All good"}, {"date": "2021-05-15", "title": "Good scent, way over priced.", "stars": "2.0 out of 5 stars", "review": "The scent is nice but the item is way over priced."}, {"date": "2021-04-13", "title": "DISAPPOINTING", "stars": "1.0 out of 5 stars", "review": "I really love the smell of this candle but I never got the chance to enjoy it. I ordered it once and it shows up broken. i get a replacement and it shows up even more broken than the last time.\n\nI'm annoyed and frustrated. I've bought other candles from this company and they are amazing. it's just disappointing that for whatever reason I never got the chance to try this one.\n\nsmells good before burning at least."}, {"date": "2021-04-11", "title": "Great product", "stars": "5.0 out of 5 stars", "review": "My mother loves it!!!!"}, {"date": "2021-03-30", "title": "Smell very good", "stars": "5.0 out of 5 stars", "review": "Smell very good"}, {"date": "2021-03-06", "title": "another fine candle.", "stars": "5.0 out of 5 stars", "review": "as advertised, smells as it should. excellent packaging, great delivery service. light the candle for at least 4 hrs.' at a time. it keeps the 'puddle' even."}, {"date": "2021-02-26", "title": "broken glass", "stars": "1.0 out of 5 stars", "review": "arrived broken. it was wrapped in bubble wrap, not a cardboard brace like other candles are, and the lid area was shattered. The small box with the candle was inside a larger box, even though it didn't come with any other products, so it probably moved around a lot."}, {"date": "2021-02-22", "title": "A FANTASTIC Experience!!!", "stars": "5.0 out of 5 stars", "review": "Interacting with UrbanInspirations was a true pleasure! I will definitely look to order from them again in the future!!!"}, {"date": "2021-02-13", "title": "The size was good and smell is nice", "stars": "5.0 out of 5 stars", "review": "Glad candle was for me and not a gift as it came looking like it has already melted the lid was a mess"}, {"date": "2021-02-08", "title": "Authentic, Lovely, Cozy.", "stars": "5.0 out of 5 stars", "review": "Lovely. I’ve ordered Yankee candles straight from their website before and have found that certain scents are not as “strong” as others. Does not mean they are not authentic, it depends on the candle you purchase. This candle is a potent, lovely scent that fills the room, but not too strong as I find BBW candles. It came in original Yankee Candle packaging as well, so no need to worry about the authenticity, it is the real deal. I love the fresh clean scent of this candle, perfect for gifting or keeping for yourself. Will be ordering more :)"}, {"date": "2021-02-07", "title": "Good product.", "stars": "5.0 out of 5 stars", "review": "Smell good."}, {"date": "2021-02-06", "title": "Very nice scent", "stars": "5.0 out of 5 stars", "review": "These smell wonderful. Packaged well."}, {"date": "2021-02-04", "title": "Livraison un peu tard", "stars": "5.0 out of 5 stars", "review": "Bonne odeur"}, {"date": "2021-01-27", "title": "Good quality candles", "stars": "5.0 out of 5 stars", "review": "One of my favourite scents smells like clean clothes, and the scent payoff is great! These Yankee jars also take a very long time to burn out completely, worth the price if you’re looking for a quality candle."}, {"date": "2021-01-23", "title": "5 Stars if you like men's cologne", "stars": "5.0 out of 5 stars", "review": "I gave it 5 Stars because the scent is clean and really fills the room. I picked it based on the name and my love of the moon, but I forgot to read about the smell and I hate it, but that's my fault. It's like men's cologne. If that's what you're looking for, it's a great candle."}, {"date": "2021-01-21", "title": "Used to hate it - Now I love it", "stars": "5.0 out of 5 stars", "review": "I know people say that this smells like men's Axe, but it actually has a clean linen smell thats musky and masculine. It smells so SEXY. Smelling this, makes me feel like I am in a fresh clean bed always!"}, {"date": "2021-01-21", "title": "Yankee Candle Company Clean Cotton Large Jar Candle", "stars": "5.0 out of 5 stars", "review": "Great candle, great scent and fragrance, and long lasting, and even burning. Love Yankee Candles for the quality. I have tried many other candles, and none can hold a flame to the Yankee Candle.... (pun intended)."}, {"date": "2021-01-20", "title": "Super chocolatey", "stars": "5.0 out of 5 stars", "review": "Love it but can only burn for short time as it is very strong but that is better than not enough"}, {"date": "2020-12-27", "title": "Love the scent", "stars": "5.0 out of 5 stars", "review": "Gift"}, {"date": "2020-12-22", "title": "Yankee Candle Large 2-Wick Tumbler Candle, Mediterranean Breeze", "stars": "5.0 out of 5 stars", "review": "Love Yankee Candles. They have a great scent that can fill large rooms, while still being subtle and fragrant. Burns very evenly."}, {"date": "2020-12-22", "title": "Highly recommend", "stars": "5.0 out of 5 stars", "review": "Fresh & clean scent. Long lasting. Smells like fresh laundry."}, {"date": "2020-12-18", "title": "Great smell", "stars": "5.0 out of 5 stars", "review": "The box is just plain cardboard and says yankee candle on it, not pretty at all. The candle is big and it smells amazing, I got the Christmas Eve candle"}, {"date": "2020-12-11", "title": "Defective", "stars": "1.0 out of 5 stars", "review": "Candle arrived with all of the wax tilted to one side, completely covering the wick. Entirely unusable."}, {"date": "2020-12-05", "title": "Smell good", "stars": "5.0 out of 5 stars", "review": "It smells really good, it reminds me of someone from my past and I like it, come in a great padded package. i recommend it"}, {"date": "2020-11-26", "title": "Beautiful candle", "stars": "5.0 out of 5 stars", "review": "Smells awesome"}, {"date": "2020-11-24", "title": "Nice candle", "stars": "5.0 out of 5 stars", "review": "My one and only favorite!"}, {"date": "2020-11-19", "title": "Fragrance Inaccurate", "stars": "2.0 out of 5 stars", "review": "Does not smell like cinnamon at all."}, {"date": "2020-11-18", "title": "Great Scents", "stars": "5.0 out of 5 stars", "review": "As Described. Great product.\nCan't find these in NS, Canada and with Borders closed online is my only option.\nThanks!"}, {"date": "2020-11-14", "title": "Awesome smells great", "stars": "4.0 out of 5 stars", "review": "Smells great, lasts a long time....."}, {"date": "2020-11-09", "title": "Bad quality of scent", "stars": "1.0 out of 5 stars", "review": "Not recommended"}, {"date": "2020-11-08", "title": "smells like nothing dont waste your money", "stars": "1.0 out of 5 stars", "review": "smells like nothing"}, {"date": "2020-11-06", "title": "Long lifetime", "stars": "5.0 out of 5 stars", "review": "Long lifetime, smelling wonderful!"}, {"date": "2020-11-05", "title": "Very satisfied & smells incredible!!", "stars": "5.0 out of 5 stars", "review": "I've been wanting a Yankee Candle for a long time and when I found it on Amazon I was so happy! The candle was delivered the next day, perfect packaging, and it smells so so good! I love the smell of fresh laundry/ clean cotton so this one was an easy choice! This candle is also great as a gift or a decor piece and im going to rider more scents for Christmas gifts!"}, {"date": "2020-11-03", "title": "No, I won't be buy again", "stars": "1.0 out of 5 stars", "review": "It's so weird.. It does not smell as strong as the one I bought from Winners.. Looks like the fake version of Yankees Candles.. I don't recommend it"}, {"date": "2020-10-25", "title": "PASS :(", "stars": "1.0 out of 5 stars", "review": "The Clean Cotton scent is very fresh as burns beautifully, but the spice Pumpkin was awful. Meh scent and the wick burned horrible.\n\nThese candles are way too expensive to play the hit or miss game. Would not recommend."}, {"date": "2020-10-19", "title": "Counterfeit or 5-10 years old", "stars": "1.0 out of 5 stars", "review": "I think these are either 5-10 years old or counterfeit. They are not traditional yankee candle quality and have a fraction of the scent as the authentic ones do. Do not order"}, {"date": "2020-10-15", "title": "Never leave a candle burning.", "stars": "5.0 out of 5 stars", "review": "Canadian Thanksgiving!"}, {"date": "2020-09-16", "title": "Softly cocoa", "stars": "5.0 out of 5 stars", "review": "It was excellent choice. Not too much strong, but it is softly warmer. If you like the cocoa smell, I recommend you. Good delivery"}, {"date": "2020-09-15", "title": "My favorite scented candle", "stars": "5.0 out of 5 stars", "review": "Amazing candle, one of my favorites. Clean cozy scent everyone loves"}, {"date": "2020-09-09", "title": "broken item on delivery", "stars": "1.0 out of 5 stars", "review": "looking for replacement or money back\n\nThanks Jeff"}, {"date": "2020-08-30", "title": "Lacking scent?", "stars": "4.0 out of 5 stars", "review": "I usually love this scent of yankee candle, but this one hardly contains any smell! I’m pretty disappointed because I paid quite a bit more than I would in store, for the convenience of shopping online, only to get one that hardly smells. I’m not sure if the candle was old, mismanaged during shipping or storage, or if it’s defective but they generally smell strongly of a real cinnamon stick. These candles are wonderful if you get one that has enough scent to it."}, {"date": "2020-08-20", "title": "👌", "stars": "5.0 out of 5 stars", "review": "as described"}, {"date": "2020-08-06", "title": "Usual fragrance but not as strong as I remember.", "stars": "5.0 out of 5 stars", "review": "Beware the packaging. First order came with the glass upper rim broken. Very quick return and replacement in 2 days. Great candle and I have bought several times but the fragrance is not as strong as I remember this time."}, {"date": "2020-08-04", "title": "Smell nice", "stars": "5.0 out of 5 stars", "review": "It smells nice and looks the same as the description."}, {"date": "2020-07-23", "title": "Perfect candle", "stars": "5.0 out of 5 stars", "review": "The scent of this Clean Cotton candle is amazing!! I was worried about the shipment for this, but it came in a protective cardboard packaging in a box. No shatter and fast shipment. It was my first time purchasing a Yankee Candle and yes, it was a perfect purchase."}, {"date": "2020-07-12", "title": "Odeur", "stars": "2.0 out of 5 stars", "review": "Bonjour,\nDégage peu d'odeur parfumé"}, {"date": "2020-07-04", "title": "Love it", "stars": "5.0 out of 5 stars", "review": "Love this candle"}, {"date": "2020-06-30", "title": "Wonderful smell", "stars": "5.0 out of 5 stars", "review": "Smells very nice!!! Wonderful. Will order again!!"}, {"date": "2020-06-07", "title": "Exactly as expected from Yankee. Great products.", "stars": "5.0 out of 5 stars", "review": "Shipping time was more than expected but understandable during these times."}, {"date": "2020-06-02", "title": "Smells like a men’s cologne.", "stars": "1.0 out of 5 stars", "review": "I do not like the smell of this candle. It’s awful. I’m more of an earthy candle buyer. This is not my thing. If u like the smell of a man in your house...guess this one is for you."}, {"date": "2020-05-24", "title": "Coconut Vanilla", "stars": "1.0 out of 5 stars", "review": "Gross smell. Cannot smell coconut or vanilla . It’s also not black, at first it glowed rusty brown , now it’s a berry red.\nNot sure how to describe this scent- rotten potatoes?"}, {"date": "2020-05-24", "title": "Subtle and Nice", "stars": "5.0 out of 5 stars", "review": "Really nice and simple smelling candle. I was worried it would be overpowering or “fake” smelling like a lot of scented candles are, but the clean cotton is perfect.\n\nThe smell is quite subtle, I think I would recommend getting a 3 wick candle if you want a stronger scent."}, {"date": "2020-05-20", "title": "Chocolate layer cake candle", "stars": "5.0 out of 5 stars", "review": "Smells absolutely delicious, by far one of the best candles I’ve ever had!!❤️"}, {"date": "2020-05-15", "title": "Exactly as described", "stars": "5.0 out of 5 stars", "review": "Smells like chocolate cake."}, {"date": "2020-05-14", "title": "Great smell. Sage and citrus is wonderful.", "stars": "4.0 out of 5 stars", "review": "Smells great! Burns great.. But the wax seems to be separated in places.. Overall good candle."}, {"date": "2020-05-13", "title": "Yummy", "stars": "5.0 out of 5 stars", "review": "Boyfriend things it smells funny but I love it. Haven’t lit it in a while but can still smell it. Little pricey in my opinion but I haven’t had it that long so we’ll see how long it lasts to make up for the price"}, {"date": "2020-05-11", "title": "happy with purchase 🙂", "stars": "5.0 out of 5 stars", "review": "Fast delivery...not damaged...SMELLS FANTASTIC!!!!!!"}, {"date": "2020-05-07", "title": "It arrived broken!", "stars": "1.0 out of 5 stars", "review": "The top part of the glass holder of the candle was shattered.\nThe package was full of broken glasses.\nI cannot find a way on Amazon website to report this.\nI am pretty disappointed!"}, {"date": "2020-05-07", "title": "Broken on delivery", "stars": "1.0 out of 5 stars", "review": "Candle was delivered smashed"}, {"date": "2020-05-04", "title": "Cam broken.", "stars": "1.0 out of 5 stars", "review": "Came broken like the pictures."}, {"date": "2020-04-14", "title": "Just okay, I guess..", "stars": "2.0 out of 5 stars", "review": "Kinda cute, smells good when I smush it in my face, but otherwise does not impact the overall smell of the car.. plus, the recommended change period written on the packaging is useless, since I could hang a new one once a week and still not smell a thing.. I am a BIG Yankee candle fan, but this product just doesn’t livr up to their usual standards."}, {"date": "2020-03-12", "title": "It took a long time to arrive & box was damaged so candles all fell out", "stars": "3.0 out of 5 stars", "review": "I didn't think the smell would be so sweet...could've been my misinterpretation as I prefer a more spicy type smell."}, {"date": "2020-01-30", "title": "Burns even", "stars": "5.0 out of 5 stars", "review": "Yankee candles are the best"}, {"date": "2019-12-19", "title": "Cassé", "stars": "2.0 out of 5 stars", "review": "Elle était cassé"}, {"date": "2019-12-16", "title": "THE SMELL OF A SNACKK", "stars": "5.0 out of 5 stars", "review": "Smells great and the bar is nice. Only thing I didnt like is the packaging but that's not why you buy a candle"}, {"date": "2019-12-13", "title": "Great !", "stars": "5.0 out of 5 stars", "review": "Exactly as expected"}, {"date": "2019-12-09", "title": "The best scent yet!", "stars": "5.0 out of 5 stars", "review": "The scent of Fresh Cut Roses is far superior to any other of the scents available. I had gone to a Yankee Candle store in St. Catharines, Ontario and they told me this was only a Summer Item and only available on line (if I was lucky). I loved this so much that my last order was a Christmas present for some of my friends and family. Please keep this scent available.....it's a keeper!"}, {"date": "2019-11-20", "title": "good", "stars": "4.0 out of 5 stars", "review": "good"}, {"date": "2019-11-07", "title": "Doesn't smell like lavender.", "stars": "4.0 out of 5 stars", "review": "Doesn't smell like lavender, but smells good enough for what it is. It is super strong, so make sure it's not on a vent that is on all the time, and it will last at least a few months (mine is on month three)."}]